app/controllers/books_controller.rb

  def show
    if user_signed_in?
      @books = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]